{
  "vocab_size": 64,
  "chars": [
    "<BOS>",
    "a",
    "b",
    "c",
    "d",
    "e",
    "f",
    "g",
    "h",
    "i",
    "j",
    "k",
    "l",
    "m",
    "n",
    "o",
    "p",
    "q",
    "r",
    "s",
    "t",
    "u",
    "v",
    "w",
    "x",
    "y",
    "z",
    "ç",
    "ğ",
    "ı",
    "ö",
    "ş",
    "ü",
    "Ç",
    "Ğ",
    "İ",
    "Ö",
    "Ş",
    "Ü",
    "0",
    "1",
    "2",
    "3",
    "4",
    "5",
    "6",
    "7",
    "8",
    "9",
    "+",
    "-",
    "*",
    "/",
    "=",
    ".",
    ",",
    "(",
    ")",
    ":",
    ";",
    "!",
    "?",
    " ",
    "\n"
  ],
  "char2idx": {
    "<BOS>": 0,
    "a": 1,
    "b": 2,
    "c": 3,
    "d": 4,
    "e": 5,
    "f": 6,
    "g": 7,
    "h": 8,
    "i": 9,
    "j": 10,
    "k": 11,
    "l": 12,
    "m": 13,
    "n": 14,
    "o": 15,
    "p": 16,
    "q": 17,
    "r": 18,
    "s": 19,
    "t": 20,
    "u": 21,
    "v": 22,
    "w": 23,
    "x": 24,
    "y": 25,
    "z": 26,
    "ç": 27,
    "ğ": 28,
    "ı": 29,
    "ö": 30,
    "ş": 31,
    "ü": 32,
    "Ç": 33,
    "Ğ": 34,
    "İ": 35,
    "Ö": 36,
    "Ş": 37,
    "Ü": 38,
    "0": 39,
    "1": 40,
    "2": 41,
    "3": 42,
    "4": 43,
    "5": 44,
    "6": 45,
    "7": 46,
    "8": 47,
    "9": 48,
    "+": 49,
    "-": 50,
    "*": 51,
    "/": 52,
    "=": 53,
    ".": 54,
    ",": 55,
    "(": 56,
    ")": 57,
    ":": 58,
    ";": 59,
    "!": 60,
    "?": 61,
    " ": 62,
    "\n": 63
  },
  "idx2char": {
    "0": "<BOS>",
    "1": "a",
    "2": "b",
    "3": "c",
    "4": "d",
    "5": "e",
    "6": "f",
    "7": "g",
    "8": "h",
    "9": "i",
    "10": "j",
    "11": "k",
    "12": "l",
    "13": "m",
    "14": "n",
    "15": "o",
    "16": "p",
    "17": "q",
    "18": "r",
    "19": "s",
    "20": "t",
    "21": "u",
    "22": "v",
    "23": "w",
    "24": "x",
    "25": "y",
    "26": "z",
    "27": "ç",
    "28": "ğ",
    "29": "ı",
    "30": "ö",
    "31": "ş",
    "32": "ü",
    "33": "Ç",
    "34": "Ğ",
    "35": "İ",
    "36": "Ö",
    "37": "Ş",
    "38": "Ü",
    "39": "0",
    "40": "1",
    "41": "2",
    "42": "3",
    "43": "4",
    "44": "5",
    "45": "6",
    "46": "7",
    "47": "8",
    "48": "9",
    "49": "+",
    "50": "-",
    "51": "*",
    "52": "/",
    "53": "=",
    "54": ".",
    "55": ",",
    "56": "(",
    "57": ")",
    "58": ":",
    "59": ";",
    "60": "!",
    "61": "?",
    "62": " ",
    "63": "\n"
  }
}